{
  "lang": {
    "enUS": {
      "id": "0",
      "Welcome": {
        "mainTitle": "Welcome to gentoo.guide!",
        "mainSubTitle": "This is a page to get you up-to speed on how this site and gentoo itself works.",
        "Navigation": {
          "mainTitle": "Site Navigation",
          "mainSubTitle": "Gentoo.guide is quite different from other wikis... As it's not really a wiki in the regular sense.",
          "sec1": {
            "HTMLcontent": "Most of the site navigation is done through the sidebar. It's simple, click on the thing you want to see... <br /> Clicking on a sidebar element expands it, showing smaller sub-elements. Clicking on a big element brings you to a major (big) heading and clicking on a sub-element brings you to a sub (small) heading.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          },
          "sec2": "You can also change the language to your preferred one from the globe icon in the top bar, if it's supported of course",
          "sec3": "If you do not care about any of the information on a certain page, you can click the 'Skip the entire page' button to go all the way down to the bottom of the page",
          "secondaryTitle1": "What is gentoo.guide, exactly and why does it exist?",
          "sec4": {
            "HTMLcontent": "Gentoo.guide is an attempt to condense the (in my opinion) most useful information from the gentoo AMD64 handbook and the gentoo wiki into one well-ish* written guide. <br /> <br /> It is also a learning excersise for me, trying to learn React with NextJS. <br /> <br /> It is also, also the project I'm doing as my final, trying to graduate 12th grade.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          },
          "secondaryTitle2": "I found something wrong/wanna help translate the site, how?",
          "sec5": {
            "HTMLcontent": " For the former, submit either an issue on my codeberg/github (preferably codeberg), or if you've already figured out a fix for it, submit a pull request. <br /> <br /> As for translations, check out the README for more information on that.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          }
        }
      },
      "HowGentooWork": {
        "mainTitle": "How does gentoo linux work?",
        "mainSubTitle": "Gentoo works similarly to other linux distributions, it just has a few basic concepts that you need to grasp for it to make sense.",
        "secondaryTitle1": "Source based... What does it mean?",
        "sec1": {
          "HTMLcontent": "Source based means that every package you install is compiled on your system, using the flags and optimizations that you have set. <br /> This differes from most other distros, which have all the packages pre-compiled and ready to install. <br /> <br /> Compiling your own packages has some unique advantages like a better performance, higher level of customizability and the ability to run programs on otherwise unsupported platforms. <br /> <br /> However it has one major disadvantage... Some packages can take REALLY long to install, depending on your how fast your CPU is.",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "secondaryTitle2": "Portage... What is it?",
        "sec2": {
          "HTMLcontent": "<b>Portage</b> is the package manager and hearth of gentoo. It provides various tools for installing, updating and otherwise managing packages as well as the system itself. <br /> <br /> <b>Emerge </b> is the tool you'll be interacting with the most, as it's what does actual package management. It's syntax isn't as intuitive as something like <b>apt</b>, however it's not that bad once you get used to it. <br /> <br /> Here is how to do some common actions with <b>emerge</b>: <br /> <br /> Install a package:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label1": "Uninstall a package:",
        "Label2": "Sync repositories:",
        "Label3": "Update the whole system:",
        "Label4": "Remove unneeded packages:",
        "sec3": {
          "HTMLcontent": "A roadblock you are certain to hit at some point while using gentoo are <b>masked packages</b>. <br /> <br />A package can be <b>masked</b> for various reasons including but not limited to: <div className='ml-5 mt-3'> - Being in testing <br />- Being deprecated <br /> - Coming from an external source (<b>overlay</b>) </div> <br /> There are a few ways you can go about unmasking a package with the most straight forward one being doing it through <b>emerge</b> via <b>autounmask</b>:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label5": {
          "HTMLcontent": "After this you can use <b>dispatch-conf</b> to apply the changes, made by autounmask:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label6": {
          "HTMLcontent": "(Select <b>u</b> and press <b>Enter</b>)",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "AttentionBox1": "The language switcher does not have an indicator for the currently selected language",
        "AttentionBox2": "Pay close attention to the file dispatch-conf is about to update, as it can and will nuke your system if you aren't careful with it.",
        "secondaryTitle3": "Make.conf, the most important file",
        "sec4": {
          "HTMLcontent": "<b>Make.conf</b> or <b>/etc/portage/make.conf</b> is probably the most important file in gentoo linux. It is the main portage config file. It dictates how packages are installed and the features they are installed with, as well as what packages <b>can</b> be installed in the 1st place. <br /> <br /> You can configure A LOT in <b>make.conf</b>, however gentoo doesn't require that you fully understand it and ships somewhat sane defaults. <br /> <br /> Still, there are things you have to understand and configure yourself: <br /> <br /> ",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },

        "TFBox1": {
          "Label": "Dictates the license that a package has to use to be eligible for installation",
          "Comment": "#Enable installing packages, regardless of their license"
        },
        "TFBox2": {
          "Label": "Enables the use of more than 1 CPU core when compiling packages, which can significantly speed up their compilation",
          "Comment": "#Enable compiling packages with 8 CPU cores"
        },
        "AttentionBox3": "As a general rule of thumb, your RAM should be twice as much as your MAKEOPTS (e.g. you should have at least 16GB ram to use MAKEOPTS='-j8 -l8')",
        "TFBox3": {
          "Label": "USE, also referred to as 'USE flags' dictate what features and dependencies packages get compiled with",
          "Comment": "#Will tell the system to compile packages with wayland, vulkan and pipewire support, wherever applicable"
        },
        "EndTitle": "Alright, with all that out of the way",
        "EndSubTitle": "Let's start with",
        "EndButtonTxt": "Downloading and setting up the installation environment"
      },
      "SideBar": {
        "Text": {
          "e1": "Welcome!",
          "e2": "How does gentoo work?"
        },
        "Content": {
          "El1": {
            "e1": "Site Navigation",
            "e2": "What is Gentoo.guide?",
            "e3": "I wanna help, how?"
          },
          "El2": {
            "e1": "Source based?",
            "e2": "Portage... What is it?",
            "e3": "Make.conf, the most important file"
          }
        }
      }
    },
    "bg": {
      "id": "1",
      "Welcome": {
        "mainTitle": "Добре дошли в gentoo.guide!",
        "mainSubTitle": "Тази страница ще ви разясни как този сайт и самия Gentoo линукс работят.",
        "Navigation": {
          "mainTitle": "Навигация на сайта",
          "mainSubTitle": "Gentoo.guide е доста различен от други wikiта, защото не е wiki в нормалния смисъл на думата",
          "sec1": {
            "HTMLcontent": "Повечето навигация става чрез лявата странична лента. Елементарно е, просто кликнете върху информацията, от която се интересувате. <br /><br /> При кликване върху елемент от страничната лента, той се оголемява и под него се показват различни под-елементи. Кликването на основен елемент ще ви заведе до основна глава, а на под-елемент - към вторична.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          },
          "sec2": "Можете да смените езика си към друг, поддържан от сайта език, чрез глобус иконата, позиционирана в дясната част на горната лента.",
          "AttentionBox1": "Елементът за смяна на език не показва текущо избрания език",
          "sec3": "Ако информацията в дадена страниця не ви интересува, можете да пропуснете дадената страница, като кликнете върху бутона, позициониран долния десен ъгъл на страницата.",
          "secondaryTitle1": "Какво е gentoo.guide и защо съществува?",
          "sec4": {
            "HTMLcontent": "Gentoo.guide е опит да се събере най-важната според мен информация от официалното gentoo wiki и тяхния AMD64 handbook в един горе-долу добре написан справочник. <br /> <br /> То също така е учебно упражнение за мен, опитвайки се да науча React и NextJS, както и финалният ми проект за завършване на 12ти клас.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          },
          "secondaryTitle2": "Намерих нещо грешно в сайта/искам да помогна с превеждането му към други езици... Как?",
          "sec5": {
            "HTMLcontent": "За първото, може да добавите заявка за проблем в <b>GitHub</b>a или <b>Codeberg</b>a ми, или ако вече имате решение за проблема, изпратете <b>pull request</b> на едно от горепосочените две места.",
            "Warning": "The DOM will read this and dangerouslySetInnerHTML"
          }
        }
      },
      "HowGentooWork": {
        "mainTitle": "Как работи Gentoo линукс?",
        "mainSubTitle": "Gentoo работи подобно на други линукс дистрибуции, но има няколко основни неща, които трябва да бъдат разбрани за може да се осмисли напълно начина му на работа.",
        "secondaryTitle1": "Какво значи 'Сорс базиран' ?",
        "sec1": {
          "HTMLcontent": "'Сорс базиран' като се говори за Gentoo означава, операционната система предоставя само кода на програмите, нужни за нейната операция, а не самите програми*. <br /> <br />Това означава, че при инсталиране на повечето програми, те трябва да бъдат компилирани от инсталиращия ги компютър, преди да могат да бъдат използвани. <br /><br /> Самостоятелното компилиране на програми (пакети) има своите предимства като по-висока производителност, повече възможности за персонализиране на системата и възможност за използване на процесорни архитектури, неподдържани от други операционни системи. <br /> <br /> Има обаче един голям недостатък... Някои програми може да отнемат МНОГО дълго за инсталиране, в зависимист производителността на процесора ви.",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "secondaryTitle2": "Какво е Portage?",
        "sec2": {
          "HTMLcontent": "<b>Portage</b> е основата и пакетния мениджър на gentoo. <br/> <br/> <b>Portage</b> предоставя инструменти за инсталиране, деинсталиране и обновяване на пакети, както и цялостно управление на системата. <br /> <br /> <b>Emerge </b> е инструментът, който ще използвате най-често. Той е нещото, което управлява пакетите.<br /> <br /> Ето как се правят някои основни неща с <b>emerge</b>: <br /><br />Инсталация на пакет:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label1": "Деинсталация на пакет:",
        "Label2": "Проверка за актуалицации:",
        "Label3": "Актуализация на системата:",
        "Label4": "Премахване на ненужни пакети:",
        "sec3": {
          "HTMLcontent": "Проблем, който със сигурност ще срещнете при използване на gentoo са <b>маскирани пакети</b>. <br /> <br />Пакетът може да е маскиран по много причини, като най-честите са: <div className='ml-5 mt-3'> - Тестването му <br />- Спряна поддръжка <br /> - Идва от място, различно от официалните сървъри (от <b>overlay</b>) </div> <br /> Има доста начини за отмаскиране на пакет, но най-лесният е през <b>emerge</b> чрез <b>autounmask</b>:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label5": {
          "HTMLcontent": "След това може да използвате <b>dispatch-conf</b> за да запазите промените, направени от <b>autounmask</b>:",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "Label6": {
          "HTMLcontent": "(Избери <b>u</b> и натисни <b>Enter</b>)",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },
        "AttentionBox2": "Обръщай внимание към файла, който dispatch-conf е на път да промени, защото има възможност работата на системата да бъде препречена, ако неправилния файл бъде променен.",
        "secondaryTitle3": "Make.conf, най-важният файл",
        "sec4": {
          "HTMLcontent": "<b>Make.conf</b> или <b>/etc/portage/make.conf</b> е най-важният файл в gentoo линукс. Tой е основния конфигурационен файл на portage. В него е описано по какъв начин и с какви възможности ще бъдат компилирани пакетие, а също и кои пакети могат да бъдат инсталирани като цяло. <br /> <br /> Много може да бъде променено чрез <b>make.conf</b>, gentoo обаче не изисква пълно разбиране на всичките му опции, защото повечето настройки във файла са настроени добре по подразбиране. <br /> <br /> Има обаче и доста неща, които трябва да се настроят ръчно: <br /> <br /> ",
          "Warning": "The DOM will read this and dangerouslySetInnerHTML"
        },

        "TFBox1": {
          "Label": "Начина, по който дадена програма трябва да е лицензирана, за да може да бъде инсталирана",
          "Comment": "#Позволи инсталиране на програми, независимо от лиценза им"
        },
        "TFBox2": {
          "Label": "Позволява използване на повече от 1 процесорно ядро при компилация на програми",
          "Comment": "#Позволи използването на 8 процесорни ядра за компилация"
        },
        "AttentionBox3": "Като добра практика се счита рам паметта да е 2 пъти повече MAKEOPTS (в GB) (например, добре е да имате поне 16GB рам за MAKEOPTS='-j8 -l8')",
        "TFBox3": {
          "Label": "USE, също познато като 'USE flags' дефинира какви характеристики и зависимости пакетите имат",
          "Comment": "#Ще каже на системата да компилира пакети с поддръжка на wayland, vulkan и pipewire, където е приложимо"
        },
        "EndTitle": "Alright, with all that out of the way",
        "EndSubTitle": "Let's start with",
        "EndButtonTxt": "Downloading and setting up the installation environment"
      },
      "SideBar": {
        "Text": {
          "e1": "Добре дошли!",
          "e2": "Как работи gentoo?"
        },
        "Content": {
          "El1": {
            "e1": "Навигация на сайта",
            "e2": "Какво е Gentoo.guide?",
            "e3": "Искам да помогна, как?"
          },
          "El2": {
            "e1": "Сорс базиран?",
            "e2": "Какво е portage?",
            "e3": "Make.conf, най-важният файл"
          }
        }
      }
    }
  },
  "loading": {
    "id": "loading"
  }
}
