{
  "lang": {
    "enUS": {
      "Anchors": {
        "A0": "Getting started",
        "A1": "Installation environment?",
        "A2": "Setting up installation environment",
        "A3": "Getting the partitions ready",
        "A4": "What partitions are needed?",
        "A5": "Setting up partitions",
        "A6": "Setting up stage3"
      },

      "SectionMain1": {
        "Title": "Getting started",
        "STitle": "This page will let you know all about what an installation enviroment is, how to set it up and how to use it to get started.",

        "Section1": {
          "Title": "What is an installation environment?",
          "TB1": "An <b>installation environment</b>, also known as a <b>live ISO</b> is exactly what the name suggests - an environment for installing a linux distribution, in this case - Gentoo. <br/><br/>Most linux distributions ship their own <b>installation environment</b> (LiveISO) and Gentoo is no different, however I'd advise against using the one, provided by Gentoo. It makes the installation process unnecessarily difficult by not having a desktop environment.<br><br/>Gentoo can be installed using any other linux distribution's <b>installation environment</b>, most of which have a nice pre-configured desktop that makes the whole installation process a lot less annoying by allowing you to copy-paste long commands and to do something else while waiting for it to finish. <br/><br/> For this guide, I'll be using a <a class='yej' href='https://linuxmint.com/'>Linux Mint</a> live ISO, however as mentioned previously, pretty much any other distribution's live ISO should also get the job done."
        },

        "Section2": {
          "Title": "Downloading and setting up the installation environment",
          "TB1": "Before beginning, you are gonna need a few things: <br/><br/>",
          "List1": {
            "E1": "USB drive with a capacity of 4GB or more.",
            "E2": "Access to the internet.",
            "E3": "A few spare hours."
          },
          "TB2": "I'm gonna assume that anyone who's gotten to this point already knows how to flash an ISO to a flash drive and boot from it, however I am still gonna mention <a class='yej' href='https://www.ventoy.net/'>Ventoy</a>, because it's cool.<br/><br/>Now that you've booted off your chosen distro's live ISO, it's time to actually install Gentoo, starting with:"
        }
      },
      "SectionMain2": {
        "Title": "Getting the partitions ready",
        "STitle": "Yeah, this part is all about disks and partitions.",
        "Section1": {
          "Title": "Choosing a disk",

          "TB1": "Before doing any partitioning, you firstly need to choose a disk to be partitioned. There are no strict restrictions about what disk should be used, however it is generally recommended to install any operating system on an SSD, instead of an HDD.<br/><br/> To check the names of all disks, currently connected to your system, use: ",

          "TB2": "SATA disks should appear as /dev/sd*, NVME disks should appear as /dev/nvme*n*.<br/><br/>",

          "AB1": "A virtual disk (/dev/vda) will be used in all examples, make sure to replace that with your chosen disk, wherever necessary."
        },
        "Section2": {
          "Title": "Figuring out what partitions are actually needed",

          "TB1": "There is a slight catch that needs to be taken care of, before proceeding with partitioning the disk. That being whether your system is <b>Legacy BIOS</b> or <b>UEFI</b>, as the following steps differ slightly for each one. If you are unsure about your system, you can type the following command:",

          "TB2": "If the command errors out, your system is <b>legacy BIOS</b> and if it doesn't, it's <b>UEFI</b>."
        },
        "Section3": {
          "Title": "Setting up partitions",

          "TB1": "For the following steps, you can use whichever disk management program you want (e.g. gparted, GNOME disks, etc), <b>cfdisk</b> will be used for the demonstration.<br/><br/> 1st, wipe the existing partition table on the chosen disk:<br/><br/>",

          "AB1": "This action WILL delete *ALL* data on the selected disk and is NOT reversible! Proceed with caution!",

          "AB2": "These steps aren't *strictly* necessary, as it is possible to resize an existing partition and do the following steps alongside it, however resizing a partition is a notoriously janky process and could result in lost data. Proceed with caution either way!",

          "TB2": "After that, depending on whether your computer is <b>legacy BIOS</b> or <b>UEFI</b>, you're gonna have to set the disks up a little bit differently: <br/><br/>",

          "TB3": "Set the partition table to GPT<br/>Create 3 partitions:<br/><br/>",

          "List1": {
            "E1": "512MB type: EFI system",
            "E2": "If possible, at least 30GB, type: Linux filesystem, (root)",
            "E3": "If possible, least 50GB, type: Linux filesystem, (home) [optional]"
          },

          "AB3": "I've used partitions that are smaller than recommended in the example, as it's just there for demonstration purposes.",

          "TB4": "Set the partition table to MBR/DOS<br/>Create 2 partitions:<br/><br/>",

          "List2": {
            "E1": "If possible, at least 30GB, primary, type: Linux, (root)",
            "E2": "If possible, at least 50GB, primary, type: Linux, (home) [optional]"
          },

          "TB5": "Set the partition you created for using as root to bootable",

          "TB6": "But what about swap?<br/><br/>Don't worry about it, we'll get there when we get there. (Check the setting up zram swap chapter for more info on that)<br/><br/>Alright, now that you've made your partitions, it's time to format them appropriately. <br/><br/> You have a choice to make with the file system you want to use, as each one has it's own unique advantages. Here are some of the more common file systems:<br/><br/>",

          "List3": {
            "E1": "ext4 - the default, use it if you just want your system to work.",
            "E2": "btrfs - a more modern option, offers file system level snapshots, in case something goes wrong.",
            "E3": "xfs - an alternative file system, sorta similar to ext4.",
            "E4": "bcachefs - an alternative, experimental file system, which offers similar advantages to btrfs. While it provides similar advantages, it operates completely differently from btrfs and any other file system."
          },

          "AB4": "This guide is written with *ext4* in mind, though the steps should be mostly the same for all the other file systems, additional reading might be a good idea if you decide to use them, ESPECIALLY for *bcachefs*. ",

          "AB5": "Bcachefs requires at least Linux 6.7 to work.",

          "TB7": "Now that you've chosen your file system, it's time to format your partitions with it. In the example case:<br/><br/>",

          "AB6": "It is VERY important that your EFI System partition (/dev/vda1 in the example case) be formatted as FAT32!",

          "TB8": "At this point, your disk's partition table should looks something like this: <br/><br/>",

          "TB9": "Everything looks good? Now it's time to:"
        },

        "Section4": {
          "Title": "Mount partitions and setup 'stage 3'",

          "TB1": "Before going any further, you might wonder, what's a 'stage 3' ? <br/><br/> A 'stage 3' is simply an archived, basic gentoo system, which needs to be extracted on a disk partition in order for anything useful to be done with it. <br/><br/> Before any of that can be done, however, you need to mount your newly created partitions first. Here's how that's done:<br/><br/>1st, create a root mount point:",

          "TB2": "2nd, mount the root partition:",

          "TB3": "3rd, create the other mount points:",

          "LBL1": "If you have created a separate /home partition:",

          "TB4": "4th, mount the other partitions:",

          "LBL2": "If you have created a separate /home partition:",

          "TB5": " - Wait, aren't these 'mount points' just directories? <br/><br/> Yes! On linux, disk partitions are mounted as directories.<br/><br/>",

          "AB1": "You should still create /mnt/gentoo/boot even if your system is not EFI.",

          "TB6": "With all of that done, you are now ready to <b>download the gentoo stage3<br/><br/>1st, go to the <a class='yej' href='https://www.gentoo.org/downloads/' target='_blank'>Gentoo downloads page</a>, then select which version of the gentoo base system you want. If the words 'systemd' and 'openrc' mean nothing to you or you can't choose between the two init systems, choose the 'openrc' option <br/></br>",

          "TB7": "Right click it and copy the link:",

          "TB8": "Then go to the <b>/mnt/gentoo</b> directory and download it there with <b>wget</b><br/><br/>",

          "AB2": "Depending on your chosen Live ISO, you might need to download wget manually",

          "TB9": "After the archive has finished downloading, extract it with <b>tar</b><br/><br/>",

          "TB10": "The stage3 archive, as mentioned above contains a very basic gentoo system. You can check that for yourself by running <b>ls<b/>"
        }
      },
      "ChEnd": {
        "Title": "With our partitions setup and our base system extracted",
        "STitle": "We can now move to actually",
        "Btn": "Setting up Gentoo linux"
      }
    },
    "bg": {
      "id": "1",
      "Anchors": {
        "A0": "Нека започнем",
        "A1": "Инсталационна среда?",
        "A2": "Настройване на инсталационната среда",
        "A3": "Подготовка на дисковете",
        "A4": "Какви дискови дялове са нужни?",
        "A5": "Създаване на дисковите дялове",
        "A6": "Подготовка на stage3"
      },

      "SectionMain1": {
        "Title": "Нека започнем",
        "STitle": "Тази страница ще ви разкаже всичко за това какво е инсталационна среда, как да я настроите и как да я използвате, за да започнете.",

        "Section1": {
          "Title": "Какво е инсталационна среда?",
          "TB1": "<b>Инсталационната среда</b>, известна също като <b>live ISO</b> е точно това, което подсказва името - среда за инсталиране на Linux дистрибуция, в случая - Gentoo. <br/><br/>Повечето Linux дистрибуции идват със собствена <b>инсталационна среда</b> (LiveISO) и Gentoo не е по-различна, но бих ви посъветвал да не използвате тази, предоставена от Gentoo. Тя прави процеса на инсталиране ненужно труден, тъй като няма графична среда.<br><br/>Gentoo може да бъде инсталиран с помощта на инсталационната среда на всяка друга Linux дистрибуция, повечето от които имат предварително конфигуриран работен плот, който прави целия процес на инсталиране много пo-търпим като ви позволява да копирате и поставяте дълги команди, и да правите нещо друго, докато чакате да завърши. <br/><br/>За този сайт, live ISO-то на<a class='yej' href='https://linuxmint.com/'> Linux Mint</a>, ще бъде използвано като примерна инсталационна среда."
        },

        "Section2": {
          "Title": "Сваляне и настройване на инсталационната среда",
          "TB1": "Преди да започнете, ще ви трябват няколко неща: <br/><br/>",
          "List1": {
            "E1": "Флашка с капацитет от 4GB или повече.",
            "E2": "Достъп до интернет.",
            "E3": "Няколко свободни часа."
          },
          "TB2": "За целите на сайта, ще се предположи, че вече знаете как се инсталира LiveISO във флашка и как да стартирате компютъра си от нея.<br/><br/>Сега като сте стартирали от избраното ви Live ISO е време да започнете Gentoo инсталацията с:"
        }
      },
      "SectionMain2": {
        "Title": "Подготовка на дисковите дялове",
        "STitle": "Тази част е изцяло за дискове.",
        "Section1": {
          "Title": "Избиране на диск",

          "TB1": "Преди да извършите каквото и да е делене, трябва първо да изберете диск. Няма строги ограничения относно това кой диск трябва да се използва, но като цяло се препоръчва инсталирането на която и да е операционна система да става на SSD, вместо на HDD.<br/><br/> За да проверите имената на всички дискове, свързани към вашата система в момента, може използвате:<br/><br/>",

          "TB2": "SATA дисковете ще бъдат изписани като /dev/sd*, а NVME дискотете - като /dev/nvme*n*.<br/><br/>",

          "AB1": "Виртуален диск (/dev/vda) ще бъде използван във всички примери и трябва да бъде заменен с вашия избран диск при поставяне на командите, в които е използван."
        },
        "Section2": {
          "Title": "Определяне на необходимите дялове",

          "TB1": "Преди да започнете да делите вашия диск е важно да изясните едно нещо, дали вашият компютър е  <b>Legacy BIOS</b> или <b>UEFI</b>, понеже следващите стъпки се различават малко, в зависимост от типа на компютъра.<br/><br/>За да проверите типа на вашия компютър, може да използвате следната команда:<br/><br/>",

          "TB2": "Ако командата върне грешка или нищо, вашият компютър е <b>legacy BIOS</b>, ако не - <b>UEFI</b>."
        },
        "Section3": {
          "Title": "Създаване на дяловете",

          "TB1": "За следващите стъпки, може да използвате която и да е програма за създаване на дискови дялове (e.g. gparted, GNOME disks, etc), за демонстрациите, програмата <b>cfdisk</b> ще бъде използвана.<br/><br/> Първо, изтрийте съществуващите дялове на избрания от вас диск:<br/><br/>",

          "AB1": "Тази команда ще изтрие *ВСИЧКО* от посочения диск!",

          "AB2": "Горепосочените стъпки не са задължителни и могат да бъдат пропуснати, ако знаете как да работите с Linux дискови дялове.",

          "TB2": "След това, в зависимост дали компютърът ви е <b>Legacy BIOS</b> или <b>UEFI</b>, ще трябва да конфигурирате дисковите дялове по малко по-различен начин:",

          "TB3": "Задайте 'Partition table' - GPT и създайте следните дялове: :<br/><br/>",

          "List1": {
            "E1": "512MB type: EFI system",
            "E2": "При възможност поне 30GB, тип: Linux filesystem, (root)",
            "E3": "При възможност поне 50GB, тип: Linux filesystem, (home) [optional]"
          },

          "AB3": "Използваните в примерите, дискови дялове са по-малки от препоръчаното.",

          "TB4": "Задайте 'Partition table' - MBR/DOS и създайте следните дялове:<br/><br/>",

          "List2": {
            "E1": "При възможност поне 30GB, primary, тип: Linux, (root)",
            "E2": "При възможност поне 50GB, primary, тип: Linux, (home) [optional]"
          },

          "TB5": "Задайте дяла, заделен за root като bootable.<br/><br/>",

          "TB6": "Не се притеснявайте, ще стигнем дотам в последствие. (Проверете главата за настройване на zram swap за повече информация по този въпрос)<br/><br/>Добре, сега след като имате създадени дялове е време да ги форматирате. <br/><br/>Трябва да направите избор с файловата система, която искате да използвате, тъй като всяка има свои специфични предимства. Ето някои по-често срещани файлови системи:<br/><br/>",

          "List3": {
            "E1": "ext4 - файлова система по подразбиране, използвайте я, ако просто искате системата ви да работи.",
            "E2": "btrfs - по-модерна опция, предлага моментни снапшоти на ниво файлова система, в случай че нещо се обърка.",
            "E3": "xfs - алтернативна файлова система, подобна по фукнционалност на ext4.",
            "E4": "bcachefs - алтернативна, експериментална файлова система, която предлага подобни предимства на btrfs. Въпреки че предоставя подобни предимства, тя работи по напълно различен начин от btrfs и всяка друга файлова система."
          },

          "AB4": "Gentoo.guide е написан *ext4* предвид. Следващите стъпки би трябвало да са еднакви, независимо от файловата система, но е добра идея да прочетете малко за алтернативните файлови системи, ако имате намерение да ползвате някоя от тях, ОСОБЕНО за *bcachefs*. ",

          "AB5": "Bcachefs се нуждае от Linux ядро версия 6.7 или по-ново за да функционира.",

          "TB7": "След като сте избрали файлова система е време да форматирате дисковите дялове, в примерния случай:<br/><br/>",

          "AB6": "ИЗКЛЮЧИТЕЛНО ВАЖНО е EFI дялът ви (/dev/vda1 в примерния случай) да е форматиран като FAT32!",

          "TB8": "Към този момент, дисковите ви дялове трябва да излеждат горе-долу така: <br/><br/>",

          "TB9": "Всичко излгажда наред? Ако да, нека продължим с:"
        },

        "Section4": {
          "Title": "Прикачване на дялове и настройване на 'stage 3'",

          "TB1": "Преди да продължите напред, може би се чудите какво е „stage 3“? <br/><br/> 'Stage 3' е просто архивирана, базова Gentoo система, която трябва да бъде разархивирана на дял от диска. <br/><br/> Това обаче не може да се направи, преди първо да прикачите новосъздадените дялове. Ето как става:<br/><br/>Първо, направете точка за прикачване на root дала:",

          "TB2": "Второ, прикачете root дяла:",

          "TB3": "Трето, създайте точки за прикачване на другите дялове",

          "LBL1": "Ако имате отделен дял за /home:",

          "TB4": "Четвърто, прикачете другите дялове:",

          "LBL2": "Ако имате отделен дял за /home:",

          "TB5": " ",

          "AB1": "Създайте /mnt/gentoo/boot, дори ако системата ви не е EFI.",

          "TB6": "След всичко това е време да <b>изтеглите gentoo stage3 архива.<br/><br/>Първо, отидете на <a class='yej' href='https://www.gentoo.org/downloads/' target='_blank'>официалния Gentoo сайт за изтегляния</a> и изберете желаната от вас версия на stage3 архива. Ако думите 'systemd' и 'openrc' не ви говорят нищо, изберете 'openrc' опцията. <br/></br>",

          "TB7": "Натиснете десен бутон и копирайте линка:",

          "TB8": "След това навигирайте до <b>/mnt/gentoo</b> директорията и го изтеглете с <b>wget</b>:<br/><br/>",

          "AB2": "В зависимост от избраното от вас Live ISO, може да се наложи изтеглите 'wget' отделно.",

          "TB9": "След като архивът се изтегли, разархивирайте го с <b>tar</b>:<br/><br/>",

          "TB10": "Stage3 архива, както е подчертано по-горе, съдържа цяла основна Gentoo система. Може да проверите това с <b>ls<b/>:"
        }
      },
      "ChEnd": {
        "Title": "С настроени дялове и разархивирана базова система,",
        "STitle": "Е време за:",
        "Btn": "Инсталиране на Gentoo linux"
      }
    }
  }
}
